Revit 2026 API

# TransactionGroup(Document) Constructor

---

Constructs a transaction group object.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public TransactionGroup(
	Document document
)
```
```vb
Public Sub New (
	document As Document
)
```
```cpp
public:
TransactionGroup(
	Document^ document
)
```
```fsharp
new :
        document : Document -> TransactionGroup
```

#### Parameters

document Document
     The document for which this transaction group is being used.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

The group does not start until its Start method is called.

#### Reference

TransactionGroup Class

TransactionGroup Overload

Autodesk.Revit.DB Namespace